src/Documents/ЕжедневныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЕжедневныйОтчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВремяРаботыСотрудниковФакт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтработанноеВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЕжедневныйОтчет/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании".
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОтчета = Дата(1,1,1);
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на работу сотрудника в магазине
	Если ЗначениеЗаполнено(Сотрудник) И ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(Сотрудник, СтруктурнаяЕдиница, "СтруктурнаяЕдиница") = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотрудник ""Сотрудник"" не работает в ""СтруктурнаяЕдиница""!");
		Отказ = Истина;
	КонецЕсли;
	
	// Проверка на дубликат документа с ключевыми реквизитами
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕжедневныйОтчет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЕжедневныйОтчет КАК ЕжедневныйОтчет
		|ГДЕ
		|	ЕжедневныйОтчет.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ЕжедневныйОтчет.ДатаОтчета = &ДатаОтчета
		|	И ЕжедневныйОтчет.Ссылка <> &Ссылка
		|	И НЕ ЕжедневныйОтчет.ПометкаУдаления";

	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	Если РезультатТаблица.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ ежедневный отчет уже существует! " + РезультатТаблица[0].Ссылка);
		Отказ = Истина;
	КонецЕсли;

	// Проверка на правельное заполнения рабочего времени
	Для Каждого СтрокаОтботанноеВремя Из ОтработанноеВремя Цикл
		Если  ЗначениеЗаполнено(СтрокаОтботанноеВремя.Окончание) Тогда
			
			Если СтрокаОтботанноеВремя.Начало >= СтрокаОтботанноеВремя.Окончание Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время начала и окончания периода работы сотрудника заполненны не верно!");
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
		Иначе  СтрокаОтботанноеВремя.Окончание = '00010101000000';   
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОтботанноеВремя Из ОтработанноеВремя Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаОтботанноеВремя.Сотрудник) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен сотрудник!");
			Отказ = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	ДатаОтчета = ?(Дата = Дата(1,1,1), ТекущаяДата(), Дата);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, Режим)

	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);	
	
    // Инициализация данных документа.	
	Документы.ЕжедневныйОтчет.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	
	// Движения по регистрам
	ДвиженияДокументовСервер.ВремяРаботыСотрудниковФакт(ДополнительныеСвойства, Движения, Отказ);
    // Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	

КонецПроцедуры

#КонецОбласти
